БылковДА_70180166/src/Documents/ПриказОбОтчислении/ПриказОбОтчислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбОтчислении</name>
  <basedOn>Document.ПротоколЗаседанияКомиссии</basedOn>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженности</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПросроченныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммарноеВремяПросрочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПротоколЗаседанияКомиссии</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ПриказОбОтчислении/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПросроченныеЗадолженности.Записывать = Истина;
	Для Каждого ТекСтрокаОтчисляемыеСтуденты Из ОтчисляемыеСтуденты Цикл
		Движение = Движения.ПросроченныеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаОтчисляемыеСтуденты.Студент;
		Движение.Группа = ТекСтрокаОтчисляемыеСтуденты.Группа;
		Движение.Семестр = ТекСтрокаОтчисляемыеСтуденты.Семестр;
		Движение.КоличествоПросроченныхЗадолженностей = ТекСтрокаОтчисляемыеСтуденты.КоличествоПросроченныхЗадолженностей;
	КонецЦикла;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколЗаседанияКомиссии") Тогда
		
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры
